app/controllers/clothes_controller.rb

    def index
        clothes = Clothe.all
---
SELECT "clothes".* FROM "clothes"

    def show
        clothe = Clothe.find(params[:id])
---
SELECT "clothes".* FROM "clothes" WHERE "clothes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def create
        byebug
        clothe = Clothe.create(clothe_params)
---
INSERT INTO "clothes" ("name", "category", "size", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def destroy
        byebug
        clothe = Clothe.find(params[:id])
        clothe.destroy
---
SELECT "clothes".* FROM "clothes" WHERE "clothes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "clothes" WHERE "clothes"."id" = $1  [["id", 1]]