app/controllers/outfit_clothes_controller.rb

    def index
        outfit_clothes = OutfitClothe.all
---
SELECT "outfit_clothes".* FROM "outfit_clothes"

    def show
        outfit_clothe = OutfitClothe.find(params[:id])
---
SELECT "clothes".* FROM "clothes" WHERE "clothes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]