app/controllers/outfits_controller.rb

SELECT "outfits".* FROM "outfits"
---
    def index
        outfits = Outfit.all